; domain
;Header and description

(define (domain Port)

;remove requirements that are not needed
(:requirements :strips :fluents :typing :negative-preconditions :disjunctive-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
box height - object
)

(:predicates ;todo: define predicates here
(movable ?c - box) ;this box is a movable object
(top ?c - box) ;this bos is at the top
(at ?c - box ?d - box) ;box ?c is at another box (docker)
(link ?loc1 - box ?loc2 - box) ;there is a box that links two boxes (docks)
(ready ?b - box ?d - box);box ?c is ready to deliver on dock ?d
(green ?b - box)
(on ?c - box ?c2 - box) ;a box ?c is above other box
(max_height ?d - box ?h - height) ;Max height in a box(dock)
(height ?c - box ?h - height) ;Current height of this box
(next ?h1 - height ?h2 - height)
)

(:action move
    :parameters (?c - box ?d_org - box ?d_dst - box  ?c_org - box ?c_dst - box ?h_prev - height ?h_next - height ?h_box - height    )
    :precondition (and
    (or (green ?c) (not (green ?c_dst))) 
    (movable ?c) ;box is movable
    (top ?c) ;box is on top
    (top ?c_dst)
    (at ?c ?d_org) ;box can be found at origin box
    (on ?c ?c_org) ;box is above another box
    (link ?d_org ?d_dst) ;dock1 is linked with dock2
    (height ?c_dst ?h_prev) ;pattern matching with the current height of dst box
    (not (max_height ?d_dst ?h_prev)) ; max height on dock dst is not the current height
    (at ?c_dst ?d_dst) ;box destiny can be found at destiny dock
    (next ?h_prev ?h_next)
    (height ?c ?h_box)
    )
    :effect (and 
    (at ?c ?d_dst)
    (not (at ?c ?d_org))
    (not (on ?c ?c_org))
    (on ?c ?c_dst)
    (top ?c_org)
    (not (top ?c_dst))
    (not (height ?c ?h_box))
    (height ?c ?h_next)
    (ready ?c ?d_dst)
    (ready ?c_org ?d_org)
    (not (ready ?c ?d_org))
    )
)

(:action move-extra
    :parameters (?c - box ?d_org - box ?d_dst - box  ?c_org - box ?c_dst - box ?h_prev - height ?h_next - height ?h_box - height    )
    :precondition (and
    (not (green ?c))
    (green ?c_dst)
    (movable ?c) ;box is movable
    (top ?c) ;box is on top
    (top ?c_dst)
    (at ?c ?d_org) ;box can be found at origin box
    (on ?c ?c_org) ;box is above another box
    (link ?d_org ?d_dst) ;dock1 is linked with dock2
    (height ?c_dst ?h_prev) ;pattern matching with the current height of dst box
    (not (max_height ?d_dst ?h_prev)) ; max height on dock dst is not the current height
    (at ?c_dst ?d_dst) ;box destiny can be found at destiny dock
    (next ?h_prev ?h_next)
    (height ?c ?h_box)
    )
    :effect (and 
    (at ?c ?d_dst)
    (not (at ?c ?d_org))
    (not (on ?c ?c_org))
    (on ?c ?c_dst)
    (top ?c_org)
    (not (top ?c_dst))
    (not (height ?c ?h_box))
    (height ?c ?h_next)
    (ready ?c ?d_dst)
    (not (ready ?c_dst ?d_dst))
    (ready ?c_org ?d_org)
    (not (ready ?c ?d_org))
    )
)


)

; problem
(define (problem prueba_de_fuego_2) 
(:domain port)
(:objects
box1 box2 dock1 dock2 pallet1 pallet2 crane1 crane2 cinta - box
n0 n1 n2 - height
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (movable box1)
    (movable box2)
    (top box1)
    (top box2)
    (top crane1)
    (top crane2)
    (top cinta)
    (at crane1 crane1)
    (at crane2 crane2)
    (at cinta cinta)
    (at pallet1 dock1)
    (at pallet2 dock2)
    (at box1 dock1)
    (at box2 dock2)
    (on box1 pallet1)
    (on box2 pallet2)
    (next n0 n1)
    (next n1 n2)
    (link crane1 dock1)
    (link dock1 crane1)
    (link crane2 dock2)
    (link dock2 crane2)
    (link crane1 cinta)
    (link cinta crane1)
    (link crane2 cinta)
    (link cinta crane2)
    (max_height crane1 n1)
    (max_height crane2 n1)
    (max_height dock1 n2)
    (max_height dock2 n2)
    (max_height cinta n1)
    (height pallet1 n0)
    (height pallet2 n0)
    (height crane1 n0)
    (height crane2 n0)
    (height cinta n0)
    (height box1 n1)
    (height box2 n1)
)

(:goal (and
    (on box2 box1)
))

)

; plan
1. (move box2 dock2 crane2 pallet2 crane2 n0 n1 n1)
   deleted: (at box2 dock2) (on box2 pallet2) (top crane2)
   added: (at box2 crane2) (on box2 crane2) (top pallet2) (ready box2 crane2) (ready pallet2 dock2)
   goals met: 0 of 1
2. (move box2 crane2 cinta crane2 cinta n0 n1 n1)
   deleted: (at box2 crane2) (on box2 crane2) (top cinta) (ready box2 crane2)
   added: (at box2 cinta) (on box2 cinta) (top crane2) (ready box2 cinta) (ready crane2 crane2)
   goals met: 0 of 1
3. (move box2 cinta crane1 cinta crane1 n0 n1 n1)
   deleted: (at box2 cinta) (on box2 cinta) (top crane1) (ready box2 cinta)
   added: (at box2 crane1) (on box2 crane1) (top cinta) (ready box2 crane1) (ready cinta cinta)
   goals met: 0 of 1
4. (move box2 crane1 dock1 crane1 box1 n1 n2 n1)
   deleted: (at box2 crane1) (on box2 crane1) (top box1) (height box2 n1) (ready box2 crane1)
   added: (at box2 dock1) (on box2 box1) (top crane1) (height box2 n2) (ready box2 dock1) (ready crane1 crane1)
   goals met: 1 of 1
